# Table of Contents
## 1. Importing libraries
## 2. Importing data
## 3. Delete unnecessary columns
## 4. Merge dataframes
## 5. Task response

# 1. Importing libraries

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

# 2. Importing data

In [2]:
# Import 'orders_products_prior' and 'orders' data

path = r'C:\Users\radav\OneDrive\Documents\Career Foundry\Data Analytics\Immersion\Achievement 4 Python Fundamentals\Instacart Basket Analysis'

In [3]:
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'), index_col = False)

In [4]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'), index_col = False)

In [5]:
# Check the output
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [6]:
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status
0,0,0,2539329,1,1,2,8,NaN,New
1,1,1,2398795,1,2,3,7,15.0,Existing
2,2,2,473747,1,3,3,12,21.0,Existing
3,3,3,2254736,1,4,4,7,29.0,Existing
4,4,4,431534,1,5,4,15,28.0,Existing

In [7]:
df_ords_prior.shape

(32434489, 4)

In [8]:
df_ords.shape

(3421083, 9)

# 3. Delete unnecessary columns

In [9]:
# Remove unnamed columns from df_ords dataframe

df_ords = df_ords.drop(columns = ['Unnamed: 0.1'])

In [10]:
df_ords = df_ords.drop(columns = ['Unnamed: 0'])

In [11]:
# Check the revised output

df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status
0,2539329,1,1,2,8,NaN,New
1,2398795,1,2,3,7,15.0,Existing
2,473747,1,3,3,12,21.0,Existing
3,2254736,1,4,4,7,29.0,Existing
4,431534,1,5,4,15,28.0,Existing

In [12]:
df_ords.shape

(3421083, 7)

## 4. Merge dataframes

In [13]:
# Merge df_ords and df_ords_prior dataframes

df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [14]:
# Check the output

df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,New,196,1,0,both
1,2539329,1,1,2,8,NaN,New,14084,2,0,both
2,2539329,1,1,2,8,NaN,New,12427,3,0,both
3,2539329,1,1,2,8,NaN,New,26088,4,0,both
4,2539329,1,1,2,8,NaN,New,26405,5,0,both

In [15]:
df_merged_large['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

In [16]:
df_merged_large.tail()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status,product_id,add_to_cart_order,reordered,_merge
32434484,2977660,206209,13,1,12,7.0,Existing,14197,5,1,both
32434485,2977660,206209,13,1,12,7.0,Existing,38730,6,0,both
32434486,2977660,206209,13,1,12,7.0,Existing,31477,7,0,both
32434487,2977660,206209,13,1,12,7.0,Existing,6567,8,0,both
32434488,2977660,206209,13,1,12,7.0,Existing,22920,9,0,both

# 5. Task response

## Q2 Export the merged file

In [18]:
# Export the merged file in pickle format as “orders_products_combined.pkl”

df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))